app/controllers/users_controller.rb

  def index
    @users = User.all_except(current_user).order(created_at: :desc)
---
SELECT `users`.* FROM `users` WHERE (id NOT IN (5,6)) ORDER BY `users`.`created_at` DESC

  def show
    @flag = params[:flag]
    if @flag.to_i == 1
      users = current_user.friends
    else
      user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 ORDER BY `users`.`id` ASC LIMIT 1